CSI API ETABS v1
cDatabaseTables.GetTableForDisplayXMLString Method
 Returns data for a single table as XML in a single string. If there is nothing to be shown in the table then no data is returned.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetTableForDisplayXMLString(
	string TableKey,
	ref string[] FieldKeyList,
	string GroupName,
	bool IncludeSchema,
	ref int TableVersion,
	ref string XMLTableData
)
Function GetTableForDisplayXMLString (
	TableKey As String,
	ByRef FieldKeyList As String(),
	GroupName As String,
	IncludeSchema As Boolean,
	ByRef TableVersion As Integer,
	ByRef XMLTableData As String
) As Integer
Dim instance As cDatabaseTables
Dim TableKey As String
Dim FieldKeyList As String()
Dim GroupName As String
Dim IncludeSchema As Boolean
Dim TableVersion As Integer
Dim XMLTableData As String
Dim returnValue As Integer
returnValue = instance.GetTableForDisplayXMLString(TableKey,
	FieldKeyList, GroupName, IncludeSchema,
	TableVersion, XMLTableData)
int GetTableForDisplayXMLString(
	String^ TableKey,
	array<String^>^% FieldKeyList,
	String^ GroupName,
	bool IncludeSchema,
	int% TableVersion,
	String^% XMLTableData
)
abstract GetTableForDisplayXMLString :
        TableKey : string *
        FieldKeyList : string[] byref *
        GroupName : string *
        IncludeSchema : bool *
        TableVersion : int byref *
        XMLTableData : string byref -> int
Parameters
TableKey
Type: System.String
Input Item: The table key of the table for which data is requested.
FieldKeyList
Type: System.String[]
Input Item: A zero-based array listing the field keys associated with the specified table for which data is requested.
GroupName
Type: System.String
Input Item: The name of a group for which data will be returned.
IncludeSchema
Type: System.Boolean
Input Item: Flag indicating if the schema should be included with the table data.
TableVersion
Type: System.Int32
Returned Item: The version number of the specified table.
XMLTableData
Type: System.String
Returned Item: A string containing the XML data for the table
Return Value
Type: Int32
Returns 0 if the function executes correctly, otherwise returns nonzero
Remarks
 If the FieldKeyList array contains a single blank string the data will be provided for all fields. If the GroupName is All, or a blank string, then data will be returned for all applicable objects in the model.
See Also
Reference
cDatabaseTables Interface
ETABSv1 Namespace